/**
 * 請宣告一個二維陣列，並用巢狀for迴圈將CH4_hw2之圖形放入陣列內
 *   [
 *     [18, 27, 36, 45, 54, 63, 72, 81],
 *     [16, 24, 32, 40, 48, 56, 64],
 *     [14, 21, 28, 35, 42, 49],
 *     [12, 18, 24, 30, 36],
 *     [10, 15, 20, 25],
 *     [8, 12, 16],
 *     [6, 9],
 *     [4]
 *   ]
 */
// let arr = [];
// for (let i = 9; i > 1; i-- ) {
//     arr[i - 2] = [];
//     for (let j = 2; j <=i; j++) {
//         arr[i - 2][j - 2] = i * j;
//     } // console.log(arr[i - 2]);
// }

// for (let x = 7; x >= 0; x--) {
//     console.log(arr[x]);
// }

// let arr = [];
// let x = 0; //二維的列數

for (let i = 9; i > 1; i--) {
    arr[x] = new Array(i - 1);  //新增二維陣列
    for (let j = 2; j <= i; j++) {
        arr[x][j - 2] = i * j;
    }
    x++;
}
console.log(arr);
